index.org
# Local Variables:
# eval: (remove-hook 'after-save-hook 'the-hook)
# eval: (defun the-hook () (if (equal (buffer-file-name) "/home/matteo/src/private/haskell-eff-20151017/index.org") (org-reveal-export-to-html)))
# eval: (add-hook 'after-save-hook 'the-hook)
# End:

# Based on org-reveal 15c7043 !

#+Author: Matteo Acerbi
#+Email: matteo.acerbi@gmail.com
#+Title: Modular and extensible effects in Haskell

#+OPTIONS: reveal_center:t reveal_progress:t reveal_history:t reveal_control:t
#+OPTIONS: reveal_mathjax:t reveal_rolling_links:t reveal_keyboard:t reveal_overview:t num:nil
#+REVEAL_HLEVEL: 1
#+REVEAL_ROOT: ./
#+REVEAL_THEME: eff
# #+REVEAL_THEME: moon
#+REVEAL_TRANS: none
#+REVEAL_PLUGINS: (highlight markdown notes)
#+OPTIONS: reveal_fragments:t
#+OPTIONS: toc:nil

* Monadic effects

** What is a monad?

Type constructor with /unit/ (=return=) and /bind/ (~>>=~),

#+BEGIN_SRC haskell
class Monad (m :: * -> *) where
  return :: a -> m a
  (>>=)  :: m a -> (a -> m b) -> m b
#+END_SRC

satisfying the following laws:

#+BEGIN_SRC haskell
return x >>= f == f x
m >>= return == m
(m >>= f) >>= g == m >>= (\ x -> f x >>= g)
#+END_SRC

** Computational effects can be modelled as monads

- Example 1: =State Int=

#+BEGIN_SRC haskell
increment :: State Int ()
increment = do
  x <- get
  put $ x+1
#+END_SRC

- Example 2: =IO=

#+BEGIN_SRC haskell
main :: IO ()
main = do
  putStrLn $ "What is your name?"
  x <- getLine
  putStrLn $ "Hello, " ++ x ++ "!"
#+END_SRC

** More than one monad?

- The underlying functors compose!

  =State s (Maybe (IO a))=

- How to deal with these "stacks" in a uniform way?

** Monad transformers

Monads with a "hole" for another monad

Values in the inner monad can be lifted to the outer

#+BEGIN_SRC haskell
class MonadTrans (f :: (* -> *) -> * -> *) where
  lift :: Monad m => m a -> t m a
#+END_SRC

=lift= must respect =return= and ~>>=~

#+BEGIN_SRC haskell
lift . return = return
lift (m >>= f) = lift m >>= (lift . f)
#+END_SRC

** Monad transformers

Examples

#+BEGIN_SRC haskell
newtype MaybeT m a = MaybeT {runMaybeT :: m (Maybe a)}

instance MonadTrans MaybeT where
  lift = MaybeT . liftM Just

type Maybe a = MaybeT Identity a
#+END_SRC

#+BEGIN_SRC haskell
newtype StateT s m a = StateT {runStateT :: s -> m (a, s)}

instance MonadTrans (StateT s) where
  lift m = StateT $ \ s -> do
    a <- m
    return (a, s)

type State s a = StateT s Identity a
#+END_SRC

** Order is relevant!

We have

~StateT s Maybe a ≠ MaybeT (State s) a~

because

~s -> Maybe (s , a) ≠ s -> (s , Maybe a)~

* Monadic programming: software engineering concerns

** Issue 1: modularity

Monolithic effects

#+BEGIN_SRC haskell
data TheMonadOfMyApp a =
  TheMonadOfMyApp (MyState -> (IO (MyLog , MyState , a)))

instance Monad TheMonadOfMyApp where
  ...

justSayHello :: TheMonadOfMyApp ()
justSayHello = TheMonadOfMyApp $ \ db -> do
  putStrLn $ "Hello!"
  return ("Just said hello!" , db , ())

main :: IO ()
main = runTheMonadOfMyApp initialState $ do
  justSayHello
  ...
#+END_SRC

** Issue 1: modularity

We would prefer

#+BEGIN_SRC haskell
justSayHello :: StdOutput ()
justSayHello = putStrLn "Hello!"
#+END_SRC

or

#+BEGIN_SRC haskell
justSayHello :: StdOutput m => m ()
justSayHello = putStrLn "Hello!"
#+END_SRC

** Issue 2: extensibility

It should also be *easy* to add a new effect to our "vocabulary"

There should be no need to

- change the types of previous code
- relate the new effect to the previously defined effects

# *  
# :PROPERTIES:
# :reveal_background: images/
# :END:

* Thesis

# :PROPERTIES:
# :reveal_background: #D39C9C
# :END:

Use *type classes* to capture monadic interfaces

** Monad Transformer Library

standard monad transformers

=+=

type classes with their abstract interfaces

#+ATTR_REVEAL: :frag roll-in

See [[http://web.cecs.pdx.edu/~mpj/pubs/springschool.html][Jones 1995]]

** Example: MonadState

#+BEGIN_SRC haskell
increment :: State Int ()
increment = do
  x <- get
  put $ x+1
#+END_SRC

becomes

#+BEGIN_SRC haskell
increment :: MonadState Int m => m ()
increment = do
  x <- get
  put $ x+1
#+END_SRC

** Example: MonadIO

#+BEGIN_SRC haskell
main :: IO ()
main = do
  putStrLn $ "What is your name?"
  x <- getLine
  putStrLn $ "Hello, " ++ x ++ "!"
#+END_SRC

becomes

#+BEGIN_SRC haskell
main :: MonadIO m => m ()
main = do
  putStrLn $ "What is your name?"
  x <- getLine
  putStrLn $ "Hello, " ++ x ++ "!"
#+END_SRC

** Problem: Cannot have many =State= s in the stack

Due to functional dependency!

#+BEGIN_SRC haskell
class Monad m => MonadState s m | m -> s where
  get :: m s
  put :: s -> m ()
#+END_SRC

If you omit ~| m -> s~, you need =OverlappingInstances=

Same for =MonadReader= and =MonadWriter=.

** Problem: Order

- The order of effects counts!

- However, we cannot constrain the order of the abstract ones.

- How to read =program=?

#+BEGIN_SRC haskell
program :: (MonadError () m , MonadState s m) => m ()
#+END_SRC

** Problem: Poor extensibility

To add the (n+1)-th monad transformer,

we must give [[https://hackage.haskell.org/package/mtl-2.2/docs/src/Control-Monad-Reader-Class.html][n instances]].

=lift= is extremely ad hoc!

* Antithesis

Represent effectful programs as *modular* *syntax*

*Handlers* interpret syntax as monads

** Free Monad

A datatype parameterised by a =f :: * -> *= operator

#+BEGIN_SRC haskell
data Free f a =
    Return a
  | Free (f (Free f a))
#+END_SRC

When =f= is a =Functor=, =Free f= is a =Monad= !

#+BEGIN_SRC haskell
instance Functor f => Monad (Free f) where
  return = Return
  (Return a) >>= f = f a
  (Free  xs) >>= f = Free (fmap (>>= f) xs)
#+END_SRC

We use =Free a= as a generic representation for monadic computations

** What is =Free f=?

- Example: Take =f = Arithmetics=

  #+BEGIN_SRC haskell
  data Arithmetics a =
      Val Int
    | Plus a a
    deriving Functor
  #+END_SRC

- =Free Arithmetics x= represents expressions made from
  - integer values
  - binary operator =+=
  - variables from the set =x=

