index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Modular and extensible effects in Haskell</title>
<meta name="author" content="Matteo Acerbi"/>
<link rel="stylesheet" href="./css/reveal.css"/>

<link rel="stylesheet" href="./css/theme/eff.css" id="theme"/>

<link rel="stylesheet" href="./lib/css/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
  <section id="sec-title-slide"><h1 class="title">Modular and extensible effects in Haskell</h1><h2 class="author">Matteo Acerbi</h2>
  <h3 class="details">2015/10/17 - Bologna - Haskell ITA</h3>
</section>

<section>
<section id="slide-orgheadline7">
<h2 id="orgheadline7">Monadic effects</h2>
<div class="outline-text-2" id="text-orgheadline7">
</div></section>
<section id="slide-orgheadline1">
<h3 id="orgheadline1">What is a monad?</h3>
<p>
Type constructor with <i>unit</i> (<code>return</code>) and <i>bind</i> (<code>&gt;&gt;=</code>),
</p>

<div class="org-src-container">

<pre><code class="haskell" >class Monad (m :: * -> *) where
  return :: a -> m a
  (>>=)  :: m a -> (a -> m b) -> m b
</code></pre>
</div>

<p>
satisfying the following laws:
</p>

<div class="org-src-container">

<pre><code class="haskell" >return x >>= f == f x
m >>= return == m
(m >>= f) >>= g == m >>= (\ x -> f x >>= g)
</code></pre>
</div>

</section>
<section id="slide-orgheadline2">
<h3 id="orgheadline2">Computational effects can be modelled as monads</h3>
<ul>
<li>Example 1: <code>State Int</code></li>

</ul>

<div class="org-src-container">

<pre><code class="haskell" >increment :: State Int ()
increment = do
  x <- get
  put $ x+1
</code></pre>
</div>

<ul>
<li>Example 2: <code>IO</code></li>

</ul>

<div class="org-src-container">

<pre><code class="haskell" >main :: IO ()
main = do
  putStrLn $ "What is your name?"
  x <- getLine
  putStrLn $ "Hello, " ++ x ++ "!"
</code></pre>
</div>

</section>
<section id="slide-orgheadline3">
<h3 id="orgheadline3">More than one monad?</h3>
<ul>
<li><p>
The underlying functors compose!
</p>

<p>
<code>State s (Maybe (IO a))</code>
</p></li>

<li>How to deal with these "stacks" in a uniform way?</li>

</ul>

</section>
<section id="slide-orgheadline4">
<h3 id="orgheadline4">Monad transformers</h3>
<p>
Monads with a "hole" for another monad
</p>

<p>
Values in the inner monad can be lifted to the outer
</p>

<div class="org-src-container">

<pre><code class="haskell" >class MonadTrans (f :: (* -> *) -> * -> *) where
  lift :: Monad m => m a -> t m a
</code></pre>
</div>

<p>
<code>lift</code> must respect <code>return</code> and <code>&gt;&gt;=</code>
</p>

<div class="org-src-container">

<pre><code class="haskell" >lift . return = return
lift (m >>= f) = lift m >>= (lift . f)
</code></pre>
</div>

</section>
<section id="slide-orgheadline5">
<h3 id="orgheadline5">Monad transformers</h3>
<p>
Examples
</p>

<div class="org-src-container">

<pre><code class="haskell" >newtype MaybeT m a = MaybeT {runMaybeT :: m (Maybe a)}

instance MonadTrans MaybeT where
  lift = MaybeT . liftM Just

type Maybe a = MaybeT Identity a
</code></pre>
</div>

<div class="org-src-container">

<pre><code class="haskell" >newtype StateT s m a = StateT {runStateT :: s -> m (a, s)}

instance MonadTrans (StateT s) where
  lift m = StateT $ \ s -> do
    a <- m
    return (a, s)

type State s a = StateT s Identity a
</code></pre>
</div>

</section>
<section id="slide-orgheadline6">
<h3 id="orgheadline6">Order is relevant!</h3>
<p>
We have
</p>

<p>
<code>StateT s Maybe a ≠ MaybeT (State s) a</code>
</p>

<p>
because
</p>

<p>
<code>s -&gt; Maybe (s , a) ≠ s -&gt; (s , Maybe a)</code>
</p>

</section>
</section>
<section>
<section id="slide-orgheadline11">
<h2 id="orgheadline11">Monadic programming: software engineering concerns</h2>
<div class="outline-text-2" id="text-orgheadline11">
</div></section>
<section id="slide-orgheadline8">
<h3 id="orgheadline8">Issue 1: modularity</h3>
<p>
Monolithic effects
</p>

<div class="org-src-container">

<pre><code class="haskell" >data TheMonadOfMyApp a =
  TheMonadOfMyApp (MyState -> (IO (MyLog , MyState , a)))

instance Monad TheMonadOfMyApp where
  ...

justSayHello :: TheMonadOfMyApp ()
justSayHello = TheMonadOfMyApp $ \ db -> do
  putStrLn $ "Hello!"
  return ("Just said hello!" , db , ())

main :: IO ()
main = runTheMonadOfMyApp initialState $ do
  justSayHello
  ...
</code></pre>
</div>

</section>
<section id="slide-orgheadline9">
<h3 id="orgheadline9">Issue 1: modularity</h3>
<p>
We would prefer
</p>

<div class="org-src-container">

<pre><code class="haskell" >justSayHello :: StdOutput ()
justSayHello = putStrLn "Hello!"
</code></pre>
</div>

<p>
or
</p>

<div class="org-src-container">

<pre><code class="haskell" >justSayHello :: StdOutput m => m ()
justSayHello = putStrLn "Hello!"
</code></pre>
</div>

</section>
<section id="slide-orgheadline10">
<h3 id="orgheadline10">Issue 2: extensibility</h3>
<p>
It should also be <b>easy</b> to add a new effect to our "vocabulary"
</p>

<p>
There should be no need to
</p>

<ul>
<li>change the types of previous code</li>
<li>relate the new effect to the previously defined effects</li>

</ul>


</section>
</section>
<section>
<section id="slide-orgheadline18">
<h2 id="orgheadline18">Thesis</h2>
<p>
Use <b>type classes</b> to capture monadic interfaces
</p>

</section>
<section id="slide-orgheadline12">
<h3 id="orgheadline12">Monad Transformer Library</h3>
<p>
standard monad transformers
</p>

<p>
<code>+</code>
</p>

<p>
type classes with their abstract interfaces
</p>

<p>
See <a href="http://web.cecs.pdx.edu/~mpj/pubs/springschool.html">Jones 1995</a>
</p>

</section>
<section id="slide-orgheadline13">
<h3 id="orgheadline13">Example: MonadState</h3>
<div class="org-src-container">

<pre><code class="haskell" >increment :: State Int ()
increment = do
  x <- get
  put $ x+1
</code></pre>
</div>

<p>
becomes
</p>

<div class="org-src-container">

<pre><code class="haskell" >increment :: MonadState Int m => m ()
increment = do
  x <- get
  put $ x+1
</code></pre>
</div>

</section>
<section id="slide-orgheadline14">
<h3 id="orgheadline14">Example: MonadIO</h3>
<div class="org-src-container">

<pre><code class="haskell" >main :: IO ()
main = do
  putStrLn $ "What is your name?"
  x <- getLine
  putStrLn $ "Hello, " ++ x ++ "!"
</code></pre>
</div>

<p>
becomes
</p>

<div class="org-src-container">

<pre><code class="haskell" >main :: MonadIO m => m ()
main = do
  putStrLn $ "What is your name?"
  x <- getLine
  putStrLn $ "Hello, " ++ x ++ "!"
</code></pre>
</div>

</section>
<section id="slide-orgheadline15">
<h3 id="orgheadline15">Problem: Cannot have many <code>State</code> s in the stack</h3>
<p>
Due to functional dependency!
</p>

<div class="org-src-container">

<pre><code class="haskell" >class Monad m => MonadState s m | m -> s where
  get :: m s
  put :: s -> m ()
</code></pre>
</div>

<p>
If you omit <code>| m -&gt; s</code>, you need <code>OverlappingInstances</code>
</p>

<p>
Same for <code>MonadReader</code> and <code>MonadWriter</code>.
</p>

</section>
<section id="slide-orgheadline16">
<h3 id="orgheadline16">Problem: Order</h3>
<ul>
<li>The order of effects counts!</li>

<li>However, we cannot constrain the order of the abstract ones.</li>

<li>How to read <code>program</code>?</li>

</ul>

<div class="org-src-container">

<pre><code class="haskell" >program :: (MonadError () m , MonadState s m) => m ()
</code></pre>
</div>

</section>
<section id="slide-orgheadline17">
<h3 id="orgheadline17">Problem: Poor extensibility</h3>
<p>
To add the (n+1)-th monad transformer,
</p>

<p>
we must give <a href="https://hackage.haskell.org/package/mtl-2.2/docs/src/Control-Monad-Reader-Class.html">n instances</a>.
</p>

<p>
<code>lift</code> is extremely ad hoc!
</p>

</section>
</section>
<section>
<section id="slide-orgheadline32">
<h2 id="orgheadline32">Antithesis</h2>
<p>
Represent effectful programs as <b>modular</b> <b>syntax</b>
</p>

<p>
<b>Handlers</b> interpret syntax as monads
</p>

</section>
<section id="slide-orgheadline19">
<h3 id="orgheadline19">Free Monad</h3>
<p>
A datatype parameterised by a <code>f :: * -&gt; *</code> operator
</p>

<div class="org-src-container">

<pre><code class="haskell" >data Free f a =
    Return a
  | Free (f (Free f a))
</code></pre>
</div>

<p>
When <code>f</code> is a <code>Functor</code>, <code>Free f</code> is a <code>Monad</code> !
</p>

<div class="org-src-container">

<pre><code class="haskell" >instance Functor f => Monad (Free f) where
  return = Return
  (Return a) >>= f = f a
  (Free  xs) >>= f = Free (fmap (>>= f) xs)
</code></pre>
</div>

<p>
We use <code>Free a</code> as a generic representation for monadic computations
</p>

</section>
<section id="slide-orgheadline20">
<h3 id="orgheadline20">What is <code>Free f</code>?</h3>
<ul>
<li><p>
Example: Take <code>f = Arithmetics</code>
</p>

<div class="org-src-container">

<pre><code class="haskell" >data Arithmetics a =
    Val Int
  | Plus a a
  deriving Functor
</code></pre>
</div></li>

<li><code>Free Arithmetics x</code> represents expressions made from
<ul>
<li>integer values</li>
<li>binary operator <code>+</code></li>
<li>variables from the set <code>x</code></li>

</ul></li>

</ul>

</section>
