index.org
** What is =Free f=?

Take =Vars= as the type of two "variables" =x= and =y=

#+BEGIN_SRC haskell
data Vars = varX | varY
#+END_SRC

=x + (2 + y)= is captured by

#+BEGIN_SRC haskell
Free (Plus (return varX)
           (Free (Plus (Val 2)
                       (return varY))))
#+END_SRC

#+ATTR_REVEAL: :frag roll-in

Monadic operations:

- =return x= is an *occurrence* of variable =x=

- ~>>=~ is *substitution*

# ** Languages?

# Yes! Main idea of this approach:

# 1. define modular and extensible syntax
# 2. define modular interpreters from that syntax to some monad

# - Should be an instance of the (co-)Yoneda lemma

# Related:

# #+BEGIN_SRC haskell
# data Coyoneda f a where
#   Coyoneda :: forall b. (b -> a) -> f b -> Coyoneda f a
# #+END_SRC

** Datatypes à la carte [W. Swierstra, 2008]

A simple notion of subtyping between functors:

#+BEGIN_SRC haskell
data (f :+: g) e = Inl (f e) | Inr (g e)

class (Functor sub, Functor sup) => (:<:) sub sup where
  inj :: sub a -> sup a

instance (Functor f, Functor g, Functor h, f :<: g) => f :<: (g :+: h) where
  inj = Inl

instance (Functor f, Functor g, Functor h, f :<: h) => f :<: (g :+: h) where
  inj = Inr
#+END_SRC

#+ATTR_REVEAL: :frag roll-in

Not real Haskell: original version has restrictions

See also [[http://wadler.blogspot.it/2008/02/data-types-la-carte.html][Wadler 2008 (blog)]], [[http://www.diku.dk/~paba/pubs/files/bahr14stg-slides.pdf][Bahr 2014 (slides)]]

** Handlers

# - If =f= is a functor and =a= a type,

#   an =f= - *algebra* is a function of type =f a -> a=

# - A *handler* is a (family of) =f=-algebra(s) to some target monad =m=:

- Take =m= as the target monad

- A *handler* for the *effect* =f= is a function of type:

  =forall a. f (m a) -> m a=

- Let's fix ~m = IO~ as target

#+BEGIN_SRC haskell
class Functor f => Handler f where
  handler :: forall a. f (IO a) -> IO a
#+END_SRC

** Example: =Teletype= + =FileSystem=

Effects

#+BEGIN_SRC haskell
data Teletype a =
    GetChar (Char -> a)
  | PutChar Char a
  deriving Functor

data FileSystem a =
    ReadFile  FilePath (String -> a)
  | WriteFile FilePath String a
  deriving Functor
#+END_SRC

Primitives

#+BEGIN_SRC haskell
getChar   :: Teletype   :<: f => Free f Char
putChar   :: Teletype   :<: f => Char -> Free f ()
readFile  :: FileSystem :<: f => FilePath -> Free f String
writeFile :: FileSystem :<: f => FilePath -> String -> Free f ()

getChar = GetChar Return
putChar c = PutChar c $ Return ()
readFile fp = ReadFile fp Return
writeFile fp s = WriteFile fp s $ Return ()
#+END_SRC

** Example: =Teletype= + =FileSystem=

Example program: UNIX =cat=

#+BEGIN_SRC haskell
cat :: FilePath -> Free (Teletype :+: FileSystem) ()
cat fp = readFile fp >>= mapM_ putChar
#+END_SRC

(Alternative type for the same program)

#+BEGIN_SRC haskell
cat :: (Teletype :<: f , FileSystem :<: f) => FilePath -> Free f ()
#+END_SRC

** Example: =Teletype= + =FileSystem=

Handlers

#+BEGIN_SRC haskell
instance Handler Teletype where
  handler (GetChar   f) = Prelude.getChar >>= f
  handler (PutChar c m) = Prelude.putChar x >> m

instance Handle FileSystem where
  handler (ReadFile  fp   f) = Prelude.readFile fp >>= f
  handler (WriteFile fp s m) = Prelude.writeFile fp s >> m
#+END_SRC

** Modularity!

Handler for the sum of two effects, given the single handlers

#+BEGIN_SRC haskell
instance (Handler f, Handler g) => Handler (f :+: g) where
  handler (Inl x) = handler x
  handler (Inr y) = handler y
#+END_SRC

A generic evaluator for effectful programs

#+BEGIN_SRC haskell
handle :: Handler f => Free f a -> IO a
handle (Return a) = return a
handle (Pure  xs) = handle (fmap handle xs)
#+END_SRC

Example: running the =cat= program in the =IO= monad

#+BEGIN_SRC haskell
main :: IO ()
main = handle cat
#+END_SRC

** Extensibility?

Easy to define a new effect!

However, extending the *target* monad is *not* considered.

E.g.: with =IO= as target monad, how to interpret =State s=?

#+BEGIN_SRC haskell
data State s a =
    Get (s -> State s a)
  | Put s (State s a)
#+END_SRC

Without unsafe tricks, =IO a= cannot manage a state of type =s=!

** Left-nested applications of =++=

Intuitively,

=(xs ++ ys) ++ zs= takes =|xs| + (|xs| + |ys|)= steps

while

=xs ++ (ys ++ zs)= takes =|xs| + |ys|= steps.

Consequence: =reverse= via =++= is $O(n^2)$ instead of $O(n)$.

** Left-nested applications of ~Free.>>=~

Similarly, for =Free=

~(m >>= f) >>= g~

is slower than

~m >>= (\ x -> f x >>= g)~

[[[http://www.janis-voigtlaender.eu/papers/AsymptoticImprovementOfComputationsOverFreeMonads.pdf][Voigtländer 2008]]] shows examples of affected algorithms.

Higher-order free-monadic programs become problematic!

** Solutions

- Unimo  [[[https://sites.google.com/site/chklin/research/unimo-icfp06.pdf?attredirects=0][Chuan-kai Lin 2006]]]
- Codensity [[[http://www.janis-voigtlaender.eu/papers/AsymptoticImprovementOfComputationsOverFreeMonads.pdf][Voigtländer 2008]]]
- Continuation [[[http://homepages.inf.ed.ac.uk/slindley/papers/handlers.pdf][KammarLindleyOury 2013]]]
- Freer [[[http://okmij.org/ftp/Haskell/extensible/more.pdf][KiselyovIshii 2015]]]
- ...

[[#faster][(details)]]

* Synthesis

Use *type classes* and *type families* to capture monadic interfaces

** Modularity

- Type families and constraint kinds allow "microeffects":

#+BEGIN_SRC haskell
class Monad m => Get a m where
  get :: m a

class Monad m => Put a m where
  put :: a -> m ()

type family State (a :: *) (m :: * -> *) :: Constraint
type instance State a m = (Get a m , Put a m)

class Monad m => Input m where
  input :: m String
class Monad m => Output m where
  output :: String -> m ()

type family InputOutput (m :: * -> *) :: Constraint
type instance InputOutput m = (Input m , Output m)
#+END_SRC

- Doing this with a class definition seems to require
=UndecidableInstances=

- Not sure about where to mention laws, though!

** Modularity

Example usage:

#+BEGIN_SRC haskell
inputAmount :: Input m => m (Maybe Amount)
inputAmount = liftM readMaybe input

deposit :: (InputOutput m , Put Amount m) => m ()
deposit = do
  x <- untilJust $ do
    output "Enter the amount you want to store:"
    inputAmount
  put x
  output "Goodbye!"
#+END_SRC

** An interesting library

- =monad-classes= by Roman Cheplyaka
- [[https://ro-che.info/articles/extensible-effects][blog]]
- [[https://github.com/feuerbach/monad-classes][code]]
- Used in production at Signal Vine
- No theoretical treatment (yet)
- Similar: =extensible-transformers=

