index.html
<section id="slide-orgheadline21">
<h3 id="orgheadline21">What is <code>Free f</code>?</h3>
<p>
Take <code>Vars</code> as the type of two "variables" <code>x</code> and <code>y</code>
</p>

<div class="org-src-container">

<pre><code class="haskell" >data Vars = varX | varY
</code></pre>
</div>

<p>
<code>x + (2 + y)</code> is captured by
</p>

<div class="org-src-container">

<pre><code class="haskell" >Free (Plus (return varX)
           (Free (Plus (Val 2)
                       (return varY))))
</code></pre>
</div>

<p>
Monadic operations:
</p>

<ul>
<li><code>return x</code> is an <b>occurrence</b> of variable <code>x</code></li>

<li><code>&gt;&gt;=</code> is <b>substitution</b></li>

</ul>







</section>
<section id="slide-orgheadline22">
<h3 id="orgheadline22">Datatypes à la carte [W. Swierstra, 2008]</h3>
<p>
A simple notion of subtyping between functors:
</p>

<div class="org-src-container">

<pre><code class="haskell" >data (f :+: g) e = Inl (f e) | Inr (g e)

class (Functor sub, Functor sup) => (:<:) sub sup where
  inj :: sub a -> sup a

instance (Functor f, Functor g, Functor h, f :<: g) => f :<: (g :+: h) where
  inj = Inl

instance (Functor f, Functor g, Functor h, f :<: h) => f :<: (g :+: h) where
  inj = Inr
</code></pre>
</div>

<p>
Not real Haskell: original version has restrictions
</p>

<p>
See also <a href="http://wadler.blogspot.it/2008/02/data-types-la-carte.html">Wadler 2008 (blog)</a>, <a href="http://www.diku.dk/~paba/pubs/files/bahr14stg-slides.pdf">Bahr 2014 (slides)</a>
</p>

</section>
<section id="slide-orgheadline23">
<h3 id="orgheadline23">Handlers</h3>
<ul>
<li>Take <code>m</code> as the target monad</li>

<li><p>
A <b>handler</b> for the <b>effect</b> <code>f</code> is a function of type:
</p>

<p>
<code>forall a. f (m a) -&gt; m a</code>
</p></li>

<li>Let's fix <code>m = IO</code> as target</li>

</ul>

<div class="org-src-container">

<pre><code class="haskell" >class Functor f => Handler f where
  handler :: forall a. f (IO a) -> IO a
</code></pre>
</div>

</section>
<section id="slide-orgheadline24">
<h3 id="orgheadline24">Example: <code>Teletype</code> + <code>FileSystem</code></h3>
<p>
Effects
</p>

<div class="org-src-container">

<pre><code class="haskell" >data Teletype a =
    GetChar (Char -> a)
  | PutChar Char a
  deriving Functor

data FileSystem a =
    ReadFile  FilePath (String -> a)
  | WriteFile FilePath String a
  deriving Functor
</code></pre>
</div>

<p>
Primitives
</p>

<div class="org-src-container">

<pre><code class="haskell" >getChar   :: Teletype   :<: f => Free f Char
putChar   :: Teletype   :<: f => Char -> Free f ()
readFile  :: FileSystem :<: f => FilePath -> Free f String
writeFile :: FileSystem :<: f => FilePath -> String -> Free f ()

getChar = GetChar Return
putChar c = PutChar c $ Return ()
readFile fp = ReadFile fp Return
writeFile fp s = WriteFile fp s $ Return ()
</code></pre>
</div>

</section>
<section id="slide-orgheadline25">
<h3 id="orgheadline25">Example: <code>Teletype</code> + <code>FileSystem</code></h3>
<p>
Example program: UNIX <code>cat</code>
</p>

<div class="org-src-container">

<pre><code class="haskell" >cat :: FilePath -> Free (Teletype :+: FileSystem) ()
cat fp = readFile fp >>= mapM_ putChar
</code></pre>
</div>

<p>
(Alternative type for the same program)
</p>

<div class="org-src-container">

<pre><code class="haskell" >cat :: (Teletype :<: f , FileSystem :<: f) => FilePath -> Free f ()
</code></pre>
</div>

</section>
<section id="slide-orgheadline26">
<h3 id="orgheadline26">Example: <code>Teletype</code> + <code>FileSystem</code></h3>
<p>
Handlers
</p>

<div class="org-src-container">

<pre><code class="haskell" >instance Handler Teletype where
  handler (GetChar   f) = Prelude.getChar >>= f
  handler (PutChar c m) = Prelude.putChar x >> m

instance Handle FileSystem where
  handler (ReadFile  fp   f) = Prelude.readFile fp >>= f
  handler (WriteFile fp s m) = Prelude.writeFile fp s >> m
</code></pre>
</div>

</section>
<section id="slide-orgheadline27">
<h3 id="orgheadline27">Modularity!</h3>
<p>
Handler for the sum of two effects, given the single handlers
</p>

<div class="org-src-container">

<pre><code class="haskell" >instance (Handler f, Handler g) => Handler (f :+: g) where
  handler (Inl x) = handler x
  handler (Inr y) = handler y
</code></pre>
</div>

<p>
A generic evaluator for effectful programs
</p>

<div class="org-src-container">

<pre><code class="haskell" >handle :: Handler f => Free f a -> IO a
handle (Return a) = return a
handle (Pure  xs) = handle (fmap handle xs)
</code></pre>
</div>

<p>
Example: running the <code>cat</code> program in the <code>IO</code> monad
</p>

<div class="org-src-container">

<pre><code class="haskell" >main :: IO ()
main = handle cat
</code></pre>
</div>

</section>
<section id="slide-orgheadline28">
<h3 id="orgheadline28">Extensibility?</h3>
<p>
Easy to define a new effect!
</p>

<p>
However, extending the <b>target</b> monad is <b>not</b> considered.
</p>

<p>
E.g.: with <code>IO</code> as target monad, how to interpret <code>State s</code>?
</p>

<div class="org-src-container">

<pre><code class="haskell" >data State s a =
    Get (s -> State s a)
  | Put s (State s a)
</code></pre>
</div>

<p>
Without unsafe tricks, <code>IO a</code> cannot manage a state of type <code>s</code>!
</p>

</section>
<section id="slide-orgheadline29">
<h3 id="orgheadline29">Left-nested applications of <code>++</code></h3>
<p>
Intuitively,
</p>

<p>
<code>(xs ++ ys) ++ zs</code> takes <code>|xs| + (|xs| + |ys|)</code> steps
</p>

<p>
while
</p>

<p>
<code>xs ++ (ys ++ zs)</code> takes <code>|xs| + |ys|</code> steps.
</p>

<p>
Consequence: <code>reverse</code> via <code>++</code> is \(O(n^2)\) instead of \(O(n)\).
</p>

</section>
<section id="slide-orgheadline30">
<h3 id="orgheadline30">Left-nested applications of <code>Free.&gt;&gt;=</code></h3>
<p>
Similarly, for <code>Free</code>
</p>

<p>
<code>(m &gt;&gt;= f) &gt;&gt;= g</code>
</p>

<p>
is slower than
</p>

<p>
<code>m &gt;&gt;= (\ x -&gt; f x &gt;&gt;= g)</code>
</p>

<p>
[<a href="http://www.janis-voigtlaender.eu/papers/AsymptoticImprovementOfComputationsOverFreeMonads.pdf">Voigtländer 2008</a>] shows examples of affected algorithms.
</p>

<p>
Higher-order free-monadic programs become problematic!
</p>

</section>
<section id="slide-orgheadline31">
<h3 id="orgheadline31">Solutions</h3>
<ul>
<li>Unimo  [<a href="https://sites.google.com/site/chklin/research/unimo-icfp06.pdf?attredirects=0">Chuan-kai Lin 2006</a>]</li>
<li>Codensity [<a href="http://www.janis-voigtlaender.eu/papers/AsymptoticImprovementOfComputationsOverFreeMonads.pdf">Voigtländer 2008</a>]</li>
<li>Continuation [<a href="http://homepages.inf.ed.ac.uk/slindley/papers/handlers.pdf">KammarLindleyOury 2013</a>]</li>
<li>Freer [<a href="http://okmij.org/ftp/Haskell/extensible/more.pdf">KiselyovIshii 2015</a>]</li>
<li>&#x2026;</li>

</ul>

<p>
<a href="#/slide-faster">(details)</a>
</p>

</section>
</section>
<section>
<section id="slide-orgheadline43">
<h2 id="orgheadline43">Synthesis</h2>
<p>
Use <b>type classes</b> and <b>type families</b> to capture monadic interfaces
</p>

</section>
<section id="slide-orgheadline33">
<h3 id="orgheadline33">Modularity</h3>
<ul>
<li>Type families and constraint kinds allow "microeffects":</li>

</ul>

<div class="org-src-container">

<pre><code class="haskell" >class Monad m => Get a m where
  get :: m a

class Monad m => Put a m where
  put :: a -> m ()

type family State (a :: *) (m :: * -> *) :: Constraint
type instance State a m = (Get a m , Put a m)

class Monad m => Input m where
  input :: m String
class Monad m => Output m where
  output :: String -> m ()

type family InputOutput (m :: * -> *) :: Constraint
type instance InputOutput m = (Input m , Output m)
</code></pre>
</div>

<ul>
<li>Doing this with a class definition seems to require</li>

</ul>
<p>
<code>UndecidableInstances</code>
</p>

<ul>
<li>Not sure about where to mention laws, though!</li>

</ul>

</section>
<section id="slide-orgheadline34">
<h3 id="orgheadline34">Modularity</h3>
<p>
Example usage:
</p>

<div class="org-src-container">

<pre><code class="haskell" >inputAmount :: Input m => m (Maybe Amount)
inputAmount = liftM readMaybe input

deposit :: (InputOutput m , Put Amount m) => m ()
deposit = do
  x <- untilJust $ do
    output "Enter the amount you want to store:"
    inputAmount
  put x
  output "Goodbye!"
</code></pre>
</div>

</section>
<section id="slide-orgheadline35">
<h3 id="orgheadline35">An interesting library</h3>
<ul>
<li><code>monad-classes</code> by Roman Cheplyaka</li>
<li><a href="https://ro-che.info/articles/extensible-effects">blog</a></li>
<li><a href="https://github.com/feuerbach/monad-classes">code</a></li>
<li>Used in production at Signal Vine</li>
<li>No theoretical treatment (yet)</li>
<li>Similar: <code>extensible-transformers</code></li>

</ul>

</section>
