index.org
** =monad-classes=: Extensibility

- Finding a transformer in a stack, with type families

#+BEGIN_SRC haskell
type family Find (t :: (* -> *) -> (* -> *)) (m :: * -> *) :: Nat where
  Find t (t m) = Zero
  Find t (p m) = Suc (Find t m)
#+END_SRC

** =monad-classes=: Extensibility

- Example: lifting =Reader='s =ask= to any transformer stack

#+BEGIN_SRC haskell
class Monad m => MonadReaderN (n :: Nat) r m where
  askN :: Proxy n -> m r

instance Monad m => MonadReaderN Zero r (ReaderT r m) where
  askN _ = Trans.ask

instance (MonadTrans t, Monad (t m), MonadReaderN n r m, Monad m) =>
         MonadReaderN (Suc n) r (t m) where
  askN _ = lift $ askN (Proxy :: Proxy n)

type MonadReader r m = MonadReaderN (Find (ReaderT r) m) r m

ask :: forall m r . MonadReader r m => m r
ask = askN (Proxy :: Proxy (Find (ReaderT r) m))
#+END_SRC

** =monad-classes=: Extensibility

- Quadratic number of instances, no more!

- No functional dependencies -> may have several =State s=

- You can use newtypes for =s= to distinguish their roles

** =monad-classes=: =CanDo=

#+BEGIN_SRC haskell
type family CanDo (m :: (* -> *)) (eff :: k) :: Bool
#+END_SRC

- Allows the lifting to be independent of specific transformers

- We can lift to effects which are more general than those requested

- e.g.: =StateT= generalises both =ReaderT= and =WriterT=

- See [[http://ro-che.info]] for more.

** Why is this a synthesis?

- Consider the syntactic constructions

  =Free=, =Operational=, =Unimo=, =Freer= ...

- You might want to use them for your project!

- However, have your syntax instantiate the abstract interfaces:

#+BEGIN_SRC haskell
instance (Teletype :<: f) => Input (Free f) where
  input = getChar
instance (Teletype :<: f) => Output (Free f) where
  output = putChar
instance (FileSystem :<: f) => ReadFile (Free f) where
  readFile = FileSystem.readFile
instance (FileSystem :<: f) => WriteFile (Free f) where
  writeFile = FileSystem.writeFile
#+END_SRC

** Why is this a synthesis?

- Then, write programs with abstract types

#+BEGIN_SRC haskell
cat :: (Output m , ReadFile m) => FilePath -> m ()
cat fp = readFile fp >>= mapM_ output
#+END_SRC

- Pick a concrete representation only at the very end

#+BEGIN_SRC haskell
main :: IO ()
main = handle cat
#+END_SRC

(Remember that =handle :: Handler f => Free f a -> IO a=)

** Warning!

- I did not test this

- It probably needs more annotations

- It might prevent some optimisations

* Conclusions

** Datatypes à la Carte, Handlers in Action, Freer...

- Important connections with theory

- Performance oddities not unlikely
  - [[https://github.com/feuerbach/freemonad-benchmark][freemonad-benchmark]]
  - [[[http://okmij.org/ftp/Haskell/extensible/more.pdf][KiselyovIshii 2015]]]

- Still, free-monadic code can be analysed by other programs
  - optimising interpreters or compilers!
  - e.g.: Haxl

** MTL, =monad-classes=, (finally-tagless), ...

- Monad stacks are inevitable in Haskell

- Maybe also monad transformer stacks

- People will use their own
  - HisApp x y
  - TheirFramework a b c d

- Better make an effort to keep effects abstract

** Gang of Four, 1995

"Program to an 'interface', not an 'implementation'."

* QA

* Grazie!

* More ...
* ... on monad transformers
** Monatron

- solves some problems
- requires more structure:

#+BEGIN_SRC haskell
class MonadT t where
  lift    :: Monad m => m a -> t m a
  treturn :: Monad m => a -> t m a
  tbind   :: Monad m => t m a -> (a -> t m b) -> t m b
#+END_SRC

* ... on "free" effects
** Effects, syntactically

The syntactic =State= monad

#+BEGIN_SRC haskell
data State s x =
    Return x
  | Get (s -> State s x)
  | Put s (State s x)

instance Monad State where
  return = Return
  (Get k  ) >>= f = Get (\ s -> k s >>= f)
  (Put s x) >>= f = Put s (x >>= f)

handle :: State s x -> s -> (s , x)
handle (Return x  ) s = (s , x)
handle (Get    f  ) s = handle (f s) s
handle (Put    s x) _ = handle
#+END_SRC

** Effects, syntactically

Programs in the syntactic State monad

#+BEGIN_SRC haskell
get :: State s s
get = Get (\ s -> Return s)

put :: State s ()
put s = Put s (Return ())

increment :: State Int ()
increment = get >>= put . (+1)
#+END_SRC

#+ATTR_REVEAL: :frag roll-in

** Problem: syntactic =State= is not modular!

We need a more generic representation

# *  
# :PROPERTIES:
# :reveal_background: images/gof.jpg
# :END:

* ... on faster free monadic computations
  :PROPERTIES:
  :CUSTOM_ID: faster
  :END:
** Alternative free monad: =Operational=

#+BEGIN_SRC haskell
data Operational f a where
    Return :: a -> Operational f a
    Then   :: forall a. f a -> (a -> Operational f b) -> Operational f b
#+END_SRC

By Parametricity, =Operational f a= is isomorphic to =Free f a=

** 1. Unimo [[[https://sites.google.com/site/chklin/research/unimo-icfp06.pdf?attredirects=0][Chuan-kai Lin 2006]]]

#+BEGIN_SRC haskell
data Unimo f a =
    Return a
  | Free (f (Free f a))
  | forall b. Bind (Unimo f b) (b -> Unimo f a)
#+END_SRC

- Not really a monad
  - You must restrict observations
  - See also Uustalu 2012, Jaskelioff 2015
- Easy to use and understand
- (The =operational= package adds =Bind= internally)

** 2. Codensity [[[http://www.janis-voigtlaender.eu/papers/AsymptoticImprovementOfComputationsOverFreeMonads.pdf][Voigtländer 2008]]]

- =Codensity= transformation

#+BEGIN_SRC haskell
newtype Codensity f a = Codensity (forall r. (a -> f r) -> f r)
#+END_SRC

- Yoneda lemma implies this isomorphism:

#+BEGIN_SRC haskell
rep :: Monad m => Codensity m a -> m a
abs :: Monad m => m a -> Codensity m a
#+END_SRC

- If you use =Codensity (Free f)= instead of =Free f=:

  ~(m >>= f) >>= g~
  reduces to (almost)
  ~m >>= \ x -> f x >>= g~

  before =m=, =f= and =g= are evaluated!

- Related to CPS transformation

