index.html
<section id="slide-orgheadline36">
<h3 id="orgheadline36"><code>monad-classes</code>: Extensibility</h3>
<ul>
<li>Finding a transformer in a stack, with type families</li>

</ul>

<div class="org-src-container">

<pre><code class="haskell" >type family Find (t :: (* -> *) -> (* -> *)) (m :: * -> *) :: Nat where
  Find t (t m) = Zero
  Find t (p m) = Suc (Find t m)
</code></pre>
</div>

</section>
<section id="slide-orgheadline37">
<h3 id="orgheadline37"><code>monad-classes</code>: Extensibility</h3>
<ul>
<li>Example: lifting <code>Reader</code>'s <code>ask</code> to any transformer stack</li>

</ul>

<div class="org-src-container">

<pre><code class="haskell" >class Monad m => MonadReaderN (n :: Nat) r m where
  askN :: Proxy n -> m r

instance Monad m => MonadReaderN Zero r (ReaderT r m) where
  askN _ = Trans.ask

instance (MonadTrans t, Monad (t m), MonadReaderN n r m, Monad m) =>
         MonadReaderN (Suc n) r (t m) where
  askN _ = lift $ askN (Proxy :: Proxy n)

type MonadReader r m = MonadReaderN (Find (ReaderT r) m) r m

ask :: forall m r . MonadReader r m => m r
ask = askN (Proxy :: Proxy (Find (ReaderT r) m))
</code></pre>
</div>

</section>
<section id="slide-orgheadline38">
<h3 id="orgheadline38"><code>monad-classes</code>: Extensibility</h3>
<ul>
<li>Quadratic number of instances, no more!</li>

<li>No functional dependencies -&gt; may have several <code>State s</code></li>

<li>You can use newtypes for <code>s</code> to distinguish their roles</li>

</ul>

</section>
<section id="slide-orgheadline39">
<h3 id="orgheadline39"><code>monad-classes</code>: <code>CanDo</code></h3>
<div class="org-src-container">

<pre><code class="haskell" >type family CanDo (m :: (* -> *)) (eff :: k) :: Bool
</code></pre>
</div>

<ul>
<li>Allows the lifting to be independent of specific transformers</li>

<li>We can lift to effects which are more general than those requested</li>

<li>e.g.: <code>StateT</code> generalises both <code>ReaderT</code> and <code>WriterT</code></li>

<li>See <a href="http://ro-che.info/">http://ro-che.info/</a> for more.</li>

</ul>

</section>
<section id="slide-orgheadline40">
<h3 id="orgheadline40">Why is this a synthesis?</h3>
<ul>
<li><p>
Consider the syntactic constructions
</p>

<p>
<code>Free</code>, <code>Operational</code>, <code>Unimo</code>, <code>Freer</code> &#x2026;
</p></li>

<li>You might want to use them for your project!</li>

<li>However, have your syntax instantiate the abstract interfaces:</li>

</ul>

<div class="org-src-container">

<pre><code class="haskell" >instance (Teletype :<: f) => Input (Free f) where
  input = getChar
instance (Teletype :<: f) => Output (Free f) where
  output = putChar
instance (FileSystem :<: f) => ReadFile (Free f) where
  readFile = FileSystem.readFile
instance (FileSystem :<: f) => WriteFile (Free f) where
  writeFile = FileSystem.writeFile
</code></pre>
</div>

</section>
<section id="slide-orgheadline41">
<h3 id="orgheadline41">Why is this a synthesis?</h3>
<ul>
<li>Then, write programs with abstract types</li>

</ul>

<div class="org-src-container">

<pre><code class="haskell" >cat :: (Output m , ReadFile m) => FilePath -> m ()
cat fp = readFile fp >>= mapM_ output
</code></pre>
</div>

<ul>
<li>Pick a concrete representation only at the very end</li>

</ul>

<div class="org-src-container">

<pre><code class="haskell" >main :: IO ()
main = handle cat
</code></pre>
</div>

<p>
(Remember that <code>handle :: Handler f =&gt; Free f a -&gt; IO a</code>)
</p>

</section>
<section id="slide-orgheadline42">
<h3 id="orgheadline42">Warning!</h3>
<ul>
<li>I did not test this</li>

<li>It probably needs more annotations</li>

<li>It might prevent some optimisations</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgheadline47">
<h2 id="orgheadline47">Conclusions</h2>
<div class="outline-text-2" id="text-orgheadline47">
</div></section>
<section id="slide-orgheadline44">
<h3 id="orgheadline44">Datatypes à la Carte, Handlers in Action, Freer&#x2026;</h3>
<ul>
<li>Important connections with theory</li>

<li>Performance oddities not unlikely
<ul>
<li><a href="https://github.com/feuerbach/freemonad-benchmark">freemonad-benchmark</a></li>
<li>[<a href="http://okmij.org/ftp/Haskell/extensible/more.pdf">KiselyovIshii 2015</a>]</li>

</ul></li>

<li>Still, free-monadic code can be analysed by other programs
<ul>
<li>optimising interpreters or compilers!</li>
<li>e.g.: Haxl</li>

</ul></li>

</ul>

</section>
<section id="slide-orgheadline45">
<h3 id="orgheadline45">MTL, <code>monad-classes</code>, (finally-tagless), &#x2026;</h3>
<ul>
<li>Monad stacks are inevitable in Haskell</li>

<li>Maybe also monad transformer stacks</li>

<li>People will use their own
<ul>
<li>HisApp x y</li>
<li>TheirFramework a b c d</li>

</ul></li>

<li>Better make an effort to keep effects abstract</li>

</ul>

</section>
<section id="slide-orgheadline46">
<h3 id="orgheadline46">Gang of Four, 1995</h3>
<p>
"Program to an 'interface', not an 'implementation'."
</p>

</section>
</section>
<section>
<section id="slide-orgheadline48">
<h2 id="orgheadline48">QA</h2>

</section>
</section>
<section>
<section id="slide-orgheadline49">
<h2 id="orgheadline49">Grazie!</h2>

</section>
</section>
<section>
<section id="slide-orgheadline50">
<h2 id="orgheadline50">More &#x2026;</h2>
</section>
</section>
<section>
<section id="slide-orgheadline52">
<h2 id="orgheadline52">&#x2026; on monad transformers</h2>
<div class="outline-text-2" id="text-orgheadline52">
</div></section>
<section id="slide-orgheadline51">
<h3 id="orgheadline51">Monatron</h3>
<ul>
<li>solves some problems</li>
<li>requires more structure:</li>

</ul>

<div class="org-src-container">

<pre><code class="haskell" >class MonadT t where
  lift    :: Monad m => m a -> t m a
  treturn :: Monad m => a -> t m a
  tbind   :: Monad m => t m a -> (a -> t m b) -> t m b
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-orgheadline56">
<h2 id="orgheadline56">&#x2026; on "free" effects</h2>
<div class="outline-text-2" id="text-orgheadline56">
</div></section>
<section id="slide-orgheadline53">
<h3 id="orgheadline53">Effects, syntactically</h3>
<p>
The syntactic <code>State</code> monad
</p>

<div class="org-src-container">

<pre><code class="haskell" >data State s x =
    Return x
  | Get (s -> State s x)
  | Put s (State s x)

instance Monad State where
  return = Return
  (Get k  ) >>= f = Get (\ s -> k s >>= f)
  (Put s x) >>= f = Put s (x >>= f)

handle :: State s x -> s -> (s , x)
handle (Return x  ) s = (s , x)
handle (Get    f  ) s = handle (f s) s
handle (Put    s x) _ = handle
</code></pre>
</div>

</section>
<section id="slide-orgheadline54">
<h3 id="orgheadline54">Effects, syntactically</h3>
<p>
Programs in the syntactic State monad
</p>

<div class="org-src-container">

<pre><code class="haskell" >get :: State s s
get = Get (\ s -> Return s)

put :: State s ()
put s = Put s (Return ())

increment :: State Int ()
increment = get >>= put . (+1)
</code></pre>
</div>

</section>
<section id="slide-orgheadline55">
<h3 id="orgheadline55">Problem: syntactic <code>State</code> is not modular!</h3>
<p>
We need a more generic representation
</p>


</section>
</section>
<section>
<section id="slide-faster">
<h2 id="faster"><a id="orgheadline63"></a>&#x2026; on faster free monadic computations</h2>
</section>
<section id="slide-orgheadline57">
<h3 id="orgheadline57">Alternative free monad: <code>Operational</code></h3>
<div class="org-src-container">

<pre><code class="haskell" >data Operational f a where
    Return :: a -> Operational f a
    Then   :: forall a. f a -> (a -> Operational f b) -> Operational f b
</code></pre>
</div>

<p>
By Parametricity, <code>Operational f a</code> is isomorphic to <code>Free f a</code>
</p>

</section>
<section id="slide-orgheadline58">
<h3 id="orgheadline58">1. Unimo [<a href="https://sites.google.com/site/chklin/research/unimo-icfp06.pdf?attredirects=0">Chuan-kai Lin 2006</a>]</h3>
<div class="org-src-container">

<pre><code class="haskell" >data Unimo f a =
    Return a
  | Free (f (Free f a))
  | forall b. Bind (Unimo f b) (b -> Unimo f a)
</code></pre>
</div>

<ul>
<li>Not really a monad
<ul>
<li>You must restrict observations</li>
<li>See also Uustalu 2012, Jaskelioff 2015</li>

</ul></li>
<li>Easy to use and understand</li>
<li>(The <code>operational</code> package adds <code>Bind</code> internally)</li>

</ul>

</section>
<section id="slide-orgheadline59">
<h3 id="orgheadline59">2. Codensity [<a href="http://www.janis-voigtlaender.eu/papers/AsymptoticImprovementOfComputationsOverFreeMonads.pdf">Voigtländer 2008</a>]</h3>
<ul>
<li><code>Codensity</code> transformation</li>

</ul>

<div class="org-src-container">

<pre><code class="haskell" >newtype Codensity f a = Codensity (forall r. (a -> f r) -> f r)
</code></pre>
</div>

<ul>
<li>Yoneda lemma implies this isomorphism:</li>

</ul>

<div class="org-src-container">

<pre><code class="haskell" >rep :: Monad m => Codensity m a -> m a
abs :: Monad m => m a -> Codensity m a
</code></pre>
</div>

<ul>
<li><p>
If you use <code>Codensity (Free f)</code> instead of <code>Free f</code>:
</p>

<p>
<code>(m &gt;&gt;= f) &gt;&gt;= g</code>
reduces to (almost)
<code>m &gt;&gt;= \ x -&gt; f x &gt;&gt;= g</code>
</p>

<p>
before <code>m</code>, <code>f</code> and <code>g</code> are evaluated!
</p></li>

<li>Related to CPS transformation</li>

</ul>

</section>
